[
  {
    "date": "2018-02-21", 
    "text": "@CNN @MSNBC Whether we are Republican or Democrat, we must now focus on strengthening Background Checks!"
  }, 
  {
    "date": "2018-02-21", 
    "text": "So true, thank you! https://t.co/9TTXlfokYz"
  }, 
  {
    "date": "2018-02-21", 
    "text": "Bad ratings @CNN &amp; @MSNBC got scammed when they covered the anti-Trump Russia rally wall-to-wall. They probably kne… https://t.co/1s5PQaBe2g"
  }, 
  {
    "date": "2018-02-20", 
    "text": "Main Street is BOOMING thanks to our incredible TAX CUT and Reform law. \"This shows small-business owners are more… https://t.co/gkJczuVCt6"
  }, 
  {
    "date": "2018-02-20", 
    "text": "....cameras running. Another False Accusation. Why doesn’t @washingtonpost report the story of the women taking mon… https://t.co/OTpK1KLYOL"
  }, 
  {
    "date": "2018-02-20", 
    "text": "A woman I don’t know and, to the best of my knowledge, never met, is on the FRONT PAGE of the Fake News Washington… https://t.co/lWlDMu6gxb"
  }, 
  {
    "date": "2018-02-20", 
    "text": "I have been much tougher on Russia than Obama, just look at the facts. Total Fake News!"
  }, 
  {
    "date": "2018-02-20", 
    "text": "Hope Republicans in the Great State of Pennsylvania challenge the new “pushed” Congressional Map, all the way to th… https://t.co/bT190oQKpM"
  }, 
  {
    "date": "2018-02-20", 
    "text": "Matt Schlapp and CPAC are getting ready for another exciting event. Big difference from those days when President O… https://t.co/KxKVJL0Bc4"
  }, 
  {
    "date": "2018-02-20", 
    "text": "Republicans are now leading the Generic Poll, perhaps because of the popular Tax Cuts which the Dems want to take a… https://t.co/TQfyR96KP8"
  }, 
  {
    "date": "2018-02-20", 
    "text": "....The President Obama quote just before election. That’s because he thought Crooked Hillary was going to win and… https://t.co/59Wli8q1pN"
  }, 
  {
    "date": "2018-02-20", 
    "text": "“There is no serious person out there who would suggest somehow that you could even rig America’s elections, there’… https://t.co/eJ9M6A2H50"
  }, 
  {
    "date": "2018-02-20", 
    "text": "Thank you to @foxandfriends for the great timeline on all of the failures the Obama Administration had against Russ… https://t.co/SI7CxX4a7C"
  }, 
  {
    "date": "2018-02-20", 
    "text": "“The Faith of Donald Trump,” a book just out by David Brody and Scott Lamb, is a very interesting read. Enjoy!"
  }, 
  {
    "date": "2018-02-20", 
    "text": "The U.S. economy is looking very good, in my opinion, even better than anticipated. Companies are pouring back into… https://t.co/Sxweprvk7N"
  }, 
  {
    "date": "2018-02-20", 
    "text": ".@MittRomney has announced he is running for the Senate from the wonderful State of Utah. He will make a great Sena… https://t.co/h1RaVb2OVj"
  }, 
  {
    "date": "2018-02-19", 
    "text": "Obama was President up to, and beyond, the 2016 Election. So why didn’t he do something about Russian meddling?"
  }, 
  {
    "date": "2018-02-19", 
    "text": "Have a great, but very reflective, President’s Day!"
  }, 
  {
    "date": "2018-02-19", 
    "text": "Just watched a very insecure Oprah Winfrey, who at one point I knew very well, interview a panel of people on 60 Mi… https://t.co/7iuf59562i"
  }, 
  {
    "date": "2018-02-18", 
    "text": "My great friends from NASCAR are having their big race today, The Daytona 500. Brian France and the France family a… https://t.co/EWBOQxPW2S"
  }, 
  {
    "date": "2018-02-18", 
    "text": "My great friends from NASCAR are having their big race today, The Daytona 500. Brian France and the France family a… https://t.co/EWBOQxPW2S"
  }, 
  {
    "date": "2018-02-18", 
    "text": "Thank you to KenStarr, former Independent Counsel, Whitewater, for your insight and powerful words on FISA abuse, R… https://t.co/XGIgUkn3qK"
  }, 
  {
    "date": "2018-02-18", 
    "text": "Great Pollster John McLaughlin now has the GOP up in the Generic Congressional Ballot. Big gain over last 4 weeks.… https://t.co/iIrNmfPgbQ"
  }
]